# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся
# элементов исходной последовательности.

spisok = [11, 1, 2, 4, 8, 3, 46, 7, 3, 4, 6, 2]
spisok = list(set(spisok))
print(spisok)
